# Unveiling the Stars: An Exploratory Study on NASA Astronauts
The exploration of NASA astronauts, a venture steeped in the allure of space exploration and human achievement, delves into a rich tapestry of individual stories and collective triumphs. While the stars above have always beckoned to humanity's sense of wonder, it is the individuals who have ventured beyond our atmosphere that make these dreams a reality.

In the realm of space exploration, talent, education, and diverse backgrounds are paramount. Every astronaut who has embarked on a journey to the cosmos is a testament to years of unwavering commitment and relentless pursuit of knowledge. Their experiences are as varied as the constellations in the night sky, with each astronaut bringing their unique set of skills, education, and expertise to the NASA family.

Yet, in the world of space exploration, it's not just about the individuals themselves; it's also about understanding the collective achievements and trends of NASA's astronaut corps. This is where a deep analysis of the provided dataset becomes pivotal.

And this is where you come in.

As an integral part of the team tasked with exploring this treasure trove of astronaut data, your role is crucial. You are the data virtuoso, the one who can transform raw information into meaningful insights that illuminate the demographics, careers, and accomplishments of NASA astronauts.

Using the latest tools and techniques in data analysis, you dissect the dataset, scrutinizing astronauts' backgrounds, experiences, and missions. You uncover patterns and trends that reveal the diverse tapestry of NASA's astronaut corps, from their educational journeys to their military service and their remarkable achievements in space.

As the project progresses, the excitement builds, and the knowledge you uncover becomes a source of inspiration. Researchers, space enthusiasts, and dreamers may not see the meticulous work behind the scenes, but they feel its impact in every chart, graph, and revelation.

In the world of astronaut analysis, you are the unsung hero, the one who helps unveil the extraordinary stories of those who have touched the stars. Your dedication to data and your ability to transform it into illuminating insights contribute to the ongoing saga of human exploration, making every astronaut's journey that much more extraordinary.

# Module 1
Task 1: Exploring NASA's Data Universe.
Our analysis of NASA's dataset is a mission to unveil profound insights within the realm of space exploration. Beyond mere data analysis, it's a journey to harness the knowledge hidden in the stars. Through this exploration, we aim to uncover patterns that will guide future missions, enhancing NASA's cosmic endeavors. Every data point is a piece of the cosmic puzzle, fueling innovation and inspiring generations to reach for the stars. In these numbers and statistics, we find the roadmap to the next frontier of human exploration.

In [2]:
# --- Import Pandas ---
import pandas as pd

#--- Read in dataset ----
df = pd.read_csv("nasa.csv")

# ---WRITE YOUR CODE FOR TASK 1 ---
#--- Inspect data ---
df

,Name,Year,GroupNum,Status,Birth_Date,Birth_Place,Gender,Alma_Mater,Undergraduate_Major,Graduate_Major,Military_Rank,Military_Branch,Space_Flights,Space_Flight_hr,Space_Walks,Space_Walks_hr,Missions,Death_Date,Death_Mission
0,Alan B. Shepard Jr.,1959,1,Deceased,18-11-1923,"East Derry, NH",Male,US Naval Academy,Naval Sciences,Naval Science,Rear Admiral,US Navy (Retired),2,216,2,9.0,"Mercury 3, Apollo 14",21-07-1998,Natural causes
1,Alan G. Poindexter,1998,17,Deceased,05-11-1961,"Pasadena, CA",Male,Georgia Institute of Technology; US Naval Post...,Aerospace Engineering,Aeronautical Engineering,Captain,US Navy,2,669,0,0.0,"STS-122 (Atlantis), STS-131 (Discovery)",01-07-2012,Personal watercraft accident
2,Alan L. Bean,1963,3,Deceased,15-03-1932,"Wheeler, TX",Male,University of Texas,Aeronautical Engineering,Aeronautical Engineering,Captain,US Navy (Retired),2,1671,3,10.0,"Apollo 12, Skylab 3",26-05-2018,Natural causes
3,Albert Sacco Jr.,1963,3,Retired,03-05-1949,"Boston, MA",Male,Northeastern University; MIT,Chemical Engineering,Chemical Engineering,Captain,US Navy (Retired),1,381,0,0.0,STS-73 (Columbia),NaN,NaN
4,Alfred M. Worden,1966,5,Retired,07-02-1932,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,William M. Shepherd,1984,10,Retired,26-07-1949,"Oak Ridge, TN",Male,US Naval Academy; MIT,Aerospace Engineering,Mechanical Engineering,Captain,US Navy (Retired),4,3823,0,0.0,"STS-37 (Atlantis), STS-41 (Discovery), STS-52 ...",NaN,NaN
353,William R. Pogue,1966,5,Retired,23-01-1930,"Okemah, OK",Male,Oklahoma Baptist University; Oklahoma State Un...,Education,Mathematics,Colonel,US Air Force (Retired),1,2017,2,13.0,Skylab 4,NaN,NaN
354,William S. McArthur Jr.,1990,3,Management,26-07-1951,"Laurinburg, NC",Male,US Military Academy; Georgia Institute of Tech...,Applied Science & Engineering,Aerospace Engineering,Colonel,US Army (Retired),4,5398,4,24.0,"STS-58 (Columbia), STS-74 (Atlantis), STS-92 (...",NaN,NaN
355,Winston E. Scott,1992,14,Retired,06-08-1950,"Miami, FL",Male,Florida State University; US Naval Postgraduat...,Music,Aeronautical Engineering,Captain,US Navy (Retired),2,590,3,19.0,"STS-72 (Endeavor), STS-87 (Columbia)",NaN,NaN
356,Yvonne D. Cagle,1996,16,Management,24-04-1959,"West Point, NY",Female,San Francisco State University,Biochemistry,Aeronautical Engineering,Colonel,US Air Force,0,0,0,0.0,"STS-72 (Endeavor), STS-87 (Columbia)",NaN,NaN

# Task 2: Exploring Data Completeness.
In the midst of your data exploration, armed with the NASA astronaut dataset, you've arrived at a crucial juncture. You're now delving into the realm of data quality, seeking to understand the integrity of the information you're working with. With a few lines of code, you've calculated the number of missing values for each column in the dataset, and the results are illuminating.

In [4]:
# --- WRITE YOUR CODE FOR TASK 2 ---
null_values = df.isnull().sum()

#--- Inspect data ---
null_values

Name                     0
Year                     0
GroupNum                 0
Status                   0
Birth_Date               0
Birth_Place              0
Gender                   0
Alma_Mater               1
Undergraduate_Major      0
Graduate_Major           0
Military_Rank            0
Military_Branch          0
Space_Flights            0
Space_Flight_hr          0
Space_Walks              0
Space_Walks_hr           0
Missions                 0
Death_Date             303
Death_Mission          309
dtype: int64

# Task 3: Data Refinement for NASA Astronaut Data.
In your ongoing journey through the NASA astronaut dataset, you've embarked on a quest for data integrity and precision. The code you've executed represents a pivotal moment in this endeavor, where you're not just analyzing data but also sculpting it to reveal the true narrative of these space pioneers.

In [10]:
# Remove rows with missing values in the 'Alma_Mater' column
df.dropna(subset=['Alma_Mater'], inplace=True)

# Filter rows where 'Death_Mission' column is null and 'Death_Date' column is not null
filtered_index = df[(df['Death_Mission'].isnull()) & (~df['Death_Date'].isnull())].index

# Remove those rows from the DataFrame 'df'
df.drop(filtered_index, inplace=True)

# Convert 'Birth_Date' and 'Death_Date' columns to datetime format with day-first parsing
df['Birth_Date'] = pd.to_datetime(df['Birth_Date'], dayfirst=True)
df['Death_Date'] = pd.to_datetime(df['Death_Date'], dayfirst=True)

# Inspect the cleaned DataFrame 'df'
df

,Name,Year,GroupNum,Status,Birth_Date,Birth_Place,Gender,Alma_Mater,Undergraduate_Major,Graduate_Major,Military_Rank,Military_Branch,Space_Flights,Space_Flight_hr,Space_Walks,Space_Walks_hr,Missions,Death_Date,Death_Mission
0,Alan B. Shepard Jr.,1959,1,Deceased,1923-11-18,"East Derry, NH",Male,US Naval Academy,Naval Sciences,Naval Science,Rear Admiral,US Navy (Retired),2,216,2,9.0,"Mercury 3, Apollo 14",1998-07-21,Natural causes
1,Alan G. Poindexter,1998,17,Deceased,1961-11-05,"Pasadena, CA",Male,Georgia Institute of Technology; US Naval Post...,Aerospace Engineering,Aeronautical Engineering,Captain,US Navy,2,669,0,0.0,"STS-122 (Atlantis), STS-131 (Discovery)",2012-07-01,Personal watercraft accident
2,Alan L. Bean,1963,3,Deceased,1932-03-15,"Wheeler, TX",Male,University of Texas,Aeronautical Engineering,Aeronautical Engineering,Captain,US Navy (Retired),2,1671,3,10.0,"Apollo 12, Skylab 3",2018-05-26,Natural causes
3,Albert Sacco Jr.,1963,3,Retired,1949-05-03,"Boston, MA",Male,Northeastern University; MIT,Chemical Engineering,Chemical Engineering,Captain,US Navy (Retired),1,381,0,0.0,STS-73 (Columbia),NaT,NaN
4,Alfred M. Worden,1966,5,Retired,1932-02-07,"Jackson, MI",Male,US Military Academy; University of Michigan,Military Science,Aeronautical & Astronautical Engineering,Colonel,US Air Force (Retired),1,295,1,0.5,Apollo 15,NaT,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
352,William M. Shepherd,1984,10,Retired,1949-07-26,"Oak Ridge, TN",Male,US Naval Academy; MIT,Aerospace Engineering,Mechanical Engineering,Captain,US Navy (Retired),4,3823,0,0.0,"STS-37 (Atlantis), STS-41 (Discovery), STS-52 ...",NaT,NaN
353,William R. Pogue,1966,5,Retired,1930-01-23,"Okemah, OK",Male,Oklahoma Baptist University; Oklahoma State Un...,Education,Mathematics,Colonel,US Air Force (Retired),1,2017,2,13.0,Skylab 4,NaT,NaN
354,William S. McArthur Jr.,1990,3,Management,1951-07-26,"Laurinburg, NC",Male,US Military Academy; Georgia Institute of Tech...,Applied Science & Engineering,Aerospace Engineering,Colonel,US Army (Retired),4,5398,4,24.0,"STS-58 (Columbia), STS-74 (Atlantis), STS-92 (...",NaT,NaN
355,Winston E. Scott,1992,14,Retired,1950-08-06,"Miami, FL",Male,Florida State University; US Naval Postgraduat...,Music,Aeronautical Engineering,Captain,US Navy (Retired),2,590,3,19.0,"STS-72 (Endeavor), STS-87 (Columbia)",NaT,NaN
356,Yvonne D. Cagle,1996,16,Management,1959-04-24,"West Point, NY",Female,San Francisco State University,Biochemistry,Aeronautical Engineering,Colonel,US Air Force,0,0,0,0.0,"STS-72 (Endeavor), STS-87 (Columbia)",NaT,NaN

# Task 4: Preparing Data for SQL Analysis.
In the midst of your data journey through the NASA astronaut dataset, you've arrived at a crucial juncture where your focus shifts to data export and preparation for a new phase in your analysis.

The destination is clear: a CSV file named 'astronauts.csv' that will serve as the foundation for your SQL exploration. This export step ensures that the data you've curated and cleaned is ready to be loaded into a relational database, where you can perform more intricate queries and derive deeper insights.

In [11]:
# ...WRITE YOUR CODE FOR TASK 4 ...
#export the cleaned data
df.to_csv("astronauts.csv", index = False)

# Task 5: Data Download, Import, and Database Connection.

In [ ]:
# -- Load the sql extention ----
%load_ext sql

# --- Load your mysql db using credentials from the "DB" area ---
%sql mysql+pymysql://<user>:<password>@localhost/<db_name>
# ALTER TABLE `TABLE 1` RENAME astronauts;

# Module 2
Task 1: Journeying Through Astronaut Profiles.
We embark on an interstellar adventure, peering into the captivating lives of NASA's space explorers. Each line of code unveils tales of cosmic bravery, where data becomes the canvas for astronauts' remarkable journeys.

As we execute this query, we're driven by the desire to inspire, inform, and honor their journeys. Each row of data represents a chapter in the grand story of space exploration, and by querying it, we're paying homage to their remarkable endeavors. We're doing this query to shed light on the heroes of the cosmic frontier and to share their awe-inspiring narratives with the world.

In [ ]:
%%sql

select * from astronauts

# Task 2: Astronaut Status: Counting the Cosmic Pioneers.
In the dim glow of computer screens, we embark on a journey to distill insights from data, transforming numbers into meaningful narratives. Our mission is to honor the dedication and diversity of cosmic pioneers, celebrating their contributions to humanity's quest for the stars.

We embark on this journey to distill insights from data, transforming numbers into meaningful narratives. The query groups astronauts by their status, revealing the dynamic tapestry of their careers - active, retired, or otherwise.

In [ ]:
%%sql

select Status , count(status) as Number
from astronauts
group by Status

# Task 3: Exploring Astronauts' Military Branch Diversity.
In the soft glow of computer screens, we continue our exploration of the astronaut dataset, our journey of honoring cosmic pioneers and uncovering the stories that connect them to the stars.

Our previous queries have illuminated the dynamic careers and diverse backgrounds of these space heroes. Now, we turn our attention to their military branches, a vital chapter in their incredible journeys.

In [ ]:
%%sql

select Military_Branch , count(Military_Branch) as Number 
from astronauts 
group by Military_Branch

# Task 4: Top Military Ranks Among Astronauts.
In the soft glow of computer screens, our cosmic journey through the astronaut dataset continues to unfold. Building upon our exploration of their military backgrounds, we now delve into the ranks that these celestial trailblazers once held in their respective armed forces.

In [ ]:
%%sql

select Military_Rank , count(Military_Rank) as Number 
from astronauts 
group by Military_Rank
order by Number desc
limit 5

# Task 5: Exploring Astronaut Demographics: Gender Insights.
Our cosmic journey through the astronaut dataset takes another captivating turn. Building upon our exploration of their military backgrounds and ranks, we now shift our focus to a crucial aspect of their diverse profiles: gender.

In [ ]:
%%sql
select Gender , count(Gender) as Number 
from astronauts 
group by Gender

# Task 6: Astronauts' Life Expectancy: A Cosmic Perspective
As our cosmic journey through the astronaut dataset continues, we embark on a quest to understand the human lifespan within the realm of space exploration. Our focus now turns to the astronauts' life expectancies, a reflection of the profound experiences and challenges they've encountered.

In this exploration, we pay tribute to the resilience and courage of these cosmic pioneers. Each astronaut's life expectancy, whether achieved or anticipated, is a testament to the unwavering spirit that propels humanity beyond Earth's bounds.

In [ ]:
%%sql

SELECT ROUND(AVG(life_Expectancy)) AS Average_Life_Expectancy
FROM (
    SELECT
        CASE
            WHEN Status = 'Deceased' THEN YEAR(Death_Date) - YEAR(Birth_Date)
            WHEN Status != 'Deceased' THEN 2023 - YEAR(Birth_Date)
        END AS life_Expectancy
    FROM
        astronauts
) AS LifeExpectancySubquery;

# Task 7: Honoring Female Astronauts: Life Expectancy.
In our ongoing journey through the astronaut dataset, we now shine a spotlight on a remarkable group of cosmic trailblazers—female astronauts. Their life expectancies, both achieved and anticipated, represent a testament to their extraordinary dedication and contribution to space exploration.

In [ ]:
%%sql

SELECT ROUND(AVG(life_Expectancy)) AS Average_Life_Expectancy
FROM (
    SELECT
        CASE
            WHEN Status = 'Deceased' and Gender = "Female" THEN YEAR(Death_Date) - YEAR(Birth_Date)
            WHEN Status != 'Deceased' and Gender = "Female" THEN 2023 - YEAR(Birth_Date)
        END AS life_Expectancy
    FROM
        astronauts
) AS LifeExpectancySubquery;

# Task 8: Celebrating Male Astronauts: Life Expectancy.
In our ongoing odyssey through the astronaut dataset, we now turn our attention to the remarkable group of male astronauts, who have left an indelible mark on the cosmos. The focus of our inquiry? Their life expectancies, a testament to their unyielding commitment and dedication to the exploration of space.

In [ ]:
%%sql

SELECT ROUND(AVG(life_Expectancy)) AS Average_Life_Expectancy
FROM (
    SELECT
        CASE
            WHEN Status = 'Deceased' and Gender = "Male" THEN YEAR(Death_Date) - YEAR(Birth_Date)
            WHEN Status != 'Deceased' and Gender = "Male" THEN 2023 - YEAR(Birth_Date)
        END AS life_Expectancy
    FROM
        astronauts
) AS LifeExpectancySubquery;

# Task 9: Cosmic Scholars: Top Graduate Majors of Astronauts.
As our cosmic exploration through the astronaut dataset unfolds, we turn our focus to the educational pathways of these cosmic adventurers. With a keen eye on their graduate majors, we aim to uncover the diverse academic foundations that have propelled them into the boundless realms of space.

This forthcoming query, though a mere compilation of data, is a portal to a world of knowledge. It reveals the top ten graduate majors, offering a glimpse into the educational tapestry that makes up the astronaut corps.

In [ ]:
%%sql

select Graduate_Major, count(Graduate_Major) as Number
from astronauts
group by Graduate_Major
order by Number desc
limit 10

# Task 10: Educational Odyssey: Astronauts and Their Degrees.
In our continuous journey through the astronaut dataset, we are now casting a wide net to encompass the full educational spectrum of these cosmic pioneers. The query we have set in motion is a treasure trove of information, offering us a profound glimpse into the academic odysseys that have propelled astronauts to the stars.

As we meticulously examine these numbers, we are not merely dealing with data points; we are delving into the very essence of these space heroes. The "Number_of_Astronauts" figure serves as a testament to the exclusive fellowship of cosmic explorers, those who have boldly transcended the boundaries of Earth.

In [ ]:
%%sql

select count(*) as Number_of_Astronauts, count(Undergraduate_Major) as Astronauts_with_Undergraduate_Degrees, count(Graduate_Major) as Astronauts_with_Graduate_Degrees 
from astronauts

# Task 11: Astronaut Birthplaces: Launching from Earth's Diverse Cities.
In our cosmic journey through the astronaut dataset, we now turn our gaze to the birthplaces of these intrepid space explorers. The query we've embarked upon, though a collection of data, is a portal to the origins of those who've ventured into the boundless cosmos.

As we dissect the numbers, we're not just dealing with statistics; we're unraveling the geographic tapestry that contributes to the astronaut corps. The birth states that emerge as the top five hold within them the beginnings of remarkable journeys.

Each city represents a unique chapter in the story of these cosmic pioneers. From bustling metropolises to quiet towns, these diverse origins reflect the universal aspiration to reach for the stars.

In [ ]:
%%sql

select SUBSTRING_INDEX(Birth_Place, ',', -1) as STATE, count(*) as Number
from astronauts
group by STATE
order by Number Desc
limit 5

# Task 12: Voyages Beyond: Astronauts' Space Flights and Spacewalks.
As our voyage through the astronaut dataset unfolds, we now set our sights on the extraordinary journeys that these cosmic pioneers have undertaken. The query we've embarked upon holds within it a wealth of experiences, a testament to the adventurous spirit of those who've ventured into the cosmos.

Our calculations of the average number of space flights and spacewalks provide insight into the vast range of missions and activities these astronauts have undertaken. Each decimal point in the result represents another moment in space, another step taken in the weightlessness of the cosmos.

These averages tell the story of dedication, training, and the relentless pursuit of scientific discovery and exploration. The numbers, though abstract, are a reflection of the countless hours of preparation and the courage required to journey beyond our planet.

In [ ]:
%%sql

select round(avg(Space_Flights),2) as Average_Number_Of_Space_Flight, round(avg(Space_Walks),2) as Average_Number_Of_Space_Walks
from astronauts